# ProfileId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..ProfileId Property
WallSweepInfo Class See Also
---
The element id of the profile family used to create the sweep or reveal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId ProfileId { get; set; }
```

Visual Basic
---
```text
Public Property ProfileId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Field Value
May be InvalidElementId if the default profile is used.
# Remarks
This value is not used when creating standalone wall sweeps. The profile id of the wall sweep's type is used instead.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace